class Prompts():
    welcome_user=("热烈欢迎男嘉宾{}的出场!")
    f_welcome_user=(
        "欢迎男嘉宾{}的出场,同时介绍你自己"
    )
    to_user_intro=(
        "请用轻松的语气让{user_name}做自我介绍"
    )
    to_f_guest_intro=(
        "{fguest_name},你听完男嘉宾{user_name}的自我介绍，如果你对他比较满意,那么请留灯,如果你对他不满意(请严格参照自己的性格以及对心目中男朋友的要求来选择灭灯还是留灯,性格不符合就灭灯)甚至他有暴力倾向,或者缺点很多，那么你就选择灭灯\n"
        "你必须在你的回答中说出'留灯'或者'灭灯',其他随意补充(但是补充的语句不能再含有'留灯'或者'灭灯'这两个字眼)"
    )
    pity=(
        "{fguest_name}灭灯了,请你安慰男嘉宾不要灰心!"
    )
    experience = (
        "继续提醒男嘉宾进入恋爱经历介绍环节"
    )
    advantage=(
        "继续提醒男嘉宾进入自身优势介绍的环节"
    )
    over=(
        "6位女嘉宾全部灭灯,请你宣告游戏结束,并表达对男嘉宾的遗憾"
    )
    to_f_guest_ex=(
        "{fguest_name},你听完男嘉宾{user_name}的恋爱经历后想法如何?如果你仍然对他满意(请严格参照自己的性格以及对心目中男朋友的要求来选择灭灯还是留灯,性格不符合就灭灯),即可以接受他在恋爱中的表现,那么请你为他留灯,如果你忍受不了他在恋爱中的表现，或者恋爱次数很多，你就选择灭灯\n"
        "你必须在你的回答中说出'留灯'或者'灭灯',其他随意补充(但是补充的语句不能再含有'留灯'或者'灭灯'这两个字眼)"
    )
    to_f_guest_ad = (
        "{fguest_name},你听完男嘉宾{user_name}的自身优势后想法如何?如果你对他不满意就灭灯(请严格参照自己的性格以及对心目中男朋友的要求来选择灭灯还是留灯,性格不符合就灭灯)如果他很吸引你,那么你可以留灯,但是如果你留灯的话将会进入男嘉宾的主动时间(即男嘉宾挑选女嘉宾),所以要仔细考虑\n如果你不满意他的条件(有暴力倾向,不顾家等),你可以选择灭灯\n"
        "你必须在你的回答中说出'留灯'或者'灭灯',其他随意补充(但是补充的语句不能再含有'留灯'或者'灭灯'这两个字眼)"
    )
    to_user_light=(
        "请你用幽默的口吻提醒男嘉宾还有女嘉宾的的灯还亮着,是否选择和她牵手"
    )
    to_user_quit=(
        "安慰{user_name},因为没有女嘉宾和她牵手"
    )
    to_f_guest_suc=(
        "恭喜{user_name}与女嘉宾牵手成功了,提醒男嘉宾快去和他选择女生牵手吧"
    )
    to_f_guest_choose_ag=(
        "提醒男嘉宾没关系,还可以继续选择"
    )
    to_f_guest_love=(
        "恭喜你和{user_name}牵手成功了,快去用亲昵的称谓去和他甜蜜吧!"
    )

